<details ><summary>plan for portal 2025-01-02 11:43:35 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#portal has been locked by PR #2
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # data.external.uuid_formatter[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "uuid_formatter" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + "./format_uuid.py",
        ]
      + query   = {
          + "raw_bytes" = (sensitive value)
        }
      + result  = (known after apply)
    }

  # cloudns_dns_record.portal[0] will be created
  + resource "cloudns_dns_record" "portal" {
      + id    = (known after apply)
      + name  = "testing"
      + ttl   = 600
      + type  = "A"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.portal_wildcard[0] will be created
  + resource "cloudns_dns_record" "portal_wildcard" {
      + id    = (known after apply)
      + name  = "*.testing"
      + ttl   = 600
      + type  = "A"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_autopilot will be created
  + resource "cloudns_dns_record" "renterd_autopilot" {
      + id    = (known after apply)
      + name  = "autopilot.portal-renterd-cluster.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_bus will be created
  + resource "cloudns_dns_record" "renterd_bus" {
      + id    = (known after apply)
      + name  = "bus.portal-renterd-cluster.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_workers[0] will be created
  + resource "cloudns_dns_record" "renterd_workers" {
      + id    = (known after apply)
      + name  = "worker-1.portal-renterd-cluster.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # random_bytes.uuid_raw[0] will be created
  + resource "random_bytes" "uuid_raw" {
      + base64  = (sensitive value)
      + hex     = (sensitive value)
      + keepers = {
          + "instance" = "0"
        }
      + length  = 16
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.redis.module.valkey_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mysql_endpoint             = (known after apply)
  + renterd_autopilot_endpoint = "autopilot.portal-renterd-cluster.node.pinner.xyz"
  + renterd_bus_endpoint       = "bus.portal-renterd-cluster.node.pinner.xyz"
  + renterd_workers_endpoints  = [
      + "worker-1.portal-renterd-cluster.node.pinner.xyz",
    ]

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (portal)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                               RESOURCE                                                |
|--------|-------------------------------------------------------------------------------------------------------|
| add    | `cloudns_dns_record.portal[0]`                                                                        |
|        | `cloudns_dns_record.portal_wildcard[0]`                                                               |
|        | `cloudns_dns_record.renterd_autopilot`                                                                |
|        | `cloudns_dns_record.renterd_bus`                                                                      |
|        | `cloudns_dns_record.renterd_workers[0]`                                                               |
|        | `random_bytes.uuid_raw[0]`                                                                            |
|        | `module.mysql.module.mysql_deployment.akash_deployment.service`                                       |
|        | `module.portal[0].module.portal_deployment.akash_deployment.service`                                  |
|        | `module.redis.module.valkey_deployment.akash_deployment.service`                                      |
|        | `module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service`  |
|        | `module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service`        |
|        | `module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service` |

| CHANGE |            OUTPUT            |
|--------|------------------------------|
| add    | `renterd_workers_endpoints`  |
|        | `mysql_endpoint`             |
|        | `renterd_autopilot_endpoint` |
|        | `renterd_bus_endpoint`       |

</details>

</details>